---
kind: type
id: T:Autodesk.Revit.DB.FilterStringGreater
source: html/15cc98bf-4b9c-71cf-5414-f8e1d6908a5f.htm
---
# Autodesk.Revit.DB.FilterStringGreater

Tests whether string values from the document would sort after a certain string.

## Syntax (C#)
```csharp
public class FilterStringGreater : FilterStringRuleEvaluator
```

## Remarks
All string comparisons in this class are performed in the case-insensitive manner.